//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.WriteLine("Ведите трёхзначное число:");
string n = Console.ReadLine();
Console.WriteLine(n[1].ToString());
